In [5]:
import numpy as  np
import pandas as pd
import matplotlib.pyplot as plt

DATASET: https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv

In [ ]:

#Note:  If an array or a series contain missing values, don't use np.median() to calculate median 
#because it will give you 'nan' as output.

In [7]:
# Loading Data
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')

In [20]:
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [66]:
titanic_data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [68]:
#Median age of the passenger 
titanic_data["Age"].median(skipna=True)
#skipna=True will skip NAN values and calculate the median

28.0

In [22]:
#check the null values of the given data
titanic_data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [71]:
#total unique values in the Name column
titanic_data.Name.value_counts().sum()

891

In [81]:
#Five highest fares of the passengers:
titanic_data.Fare.nlargest(5)

PassengerId
259    512.3292
680    512.3292
738    512.3292
28     263.0000
89     263.0000
Name: Fare, dtype: float64

In [98]:
100*np.mean([titanic_data["Sex"]=="male"])
#male passengers

64.75869809203144

In [99]:
100*np.mean([titanic_data["Sex"]=="female"])
#female passengers

35.24130190796858

In [30]:
#What is the median Fare of the passengers?
np.median(titanic_data.Fare)

14.4542

In [31]:
titanic_data.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [33]:
#Most of the passengers have -------- siblings/spouses.
titanic_data.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [61]:
survived_passengers=titanic_data[titanic_data['Survived'] == 1]
survived_passengers

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [42]:
titanic_data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [89]:
titanic_data['Survived'].sum()

342

In [92]:
titanic_data['Survived'].sum()/10

34.2

In [97]:
#What is the proportion of passengers who survived?
#(totalsurvivors/totalpassengers)
341/891

0.38271604938271603

In [62]:
#check if the first class passengers were given priority to survive
survived_passengers.Pclass.value_counts()

1    136
3    119
2     87
Name: Pclass, dtype: int64

In [64]:
#How many of the survived passengers had embarked from 'Southampton' i.e. 'S
survived_passengers.Embarked.value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [ ]:
# check if the Children were given priority to survive

In [57]:
#children
100*np.mean(titanic_data['Survived'][titanic_data['Age'] < 18])

53.98230088495575

In [58]:
#adult
100*np.mean(titanic_data['Survived'][titanic_data['Age'] >= 18])

38.10316139767055

In [ ]:
#Percentage of women survived was more than percentage of men survived

In [59]:
# survived female 
100*np.mean(titanic_data['Survived'][titanic_data['Sex'] =="female"])

74.20382165605095

In [60]:
#survived female
100*np.mean(titanic_data['Survived'][titanic_data['Sex'] =="male"])

18.890814558058924